#+title: Comparison git-svn and swh-svn
#+author: ardumont

* Comparison

|------------+--------+------------------------------------------+-------------------------+---------------------------+-------------|
| Type       | # Revs | Url                                      | git-svn (git svn clone) | swh-svn (load repository) |       Ratio |
|------------+--------+------------------------------------------+-------------------------+---------------------------+-------------|
| small      |    145 | svn://svn.debian.org/svn/pkg-fox/        |                 447.074 |       1445.8084549359046s | 3.2339354 s |
| medium     |   6006 | svn://svn.debian.org/svn/glibc-bsd/      |                4740.928 |        10118.787201701081 |   2.1343474 |
| large      |  10707 | svn://svn.debian.org/svn/pkg-voip/       |                8592.398 |        46112.436119881924 |   5.3666551 |
| very large |  34523 | svn://svn.debian.org/svn/python-modules/ |               36627.907 |       288410.36918153404s | 7.8740609 s |
| very large |  48013 | svn://svn.debian.org/svn/pkg-gnome/      |               71902.080 |          594822.724728007 |   8.2726776 |
|------------+--------+------------------------------------------+-------------------------+---------------------------+-------------|
#+TBLFM: $6=$5/$4

Note:
- Time is in seconds
- We compare storing in our swh backend (swh-loader) and storing on
  disk (git-svn).

The git-svn clones, when it finishes goes faster.
But, it remains the swh loading in swh to do.

Below are the details about the extracted times.
Feel free to skip.

** Comparison

Here is the comparison with the following options:
#+BEGIN_SRC ini
# inhibit the swh-storage part
send_contents = False
send_directories = False
send_revisions = False
send_releases = False
send_occurrences = False

with_svn_update = False
with_revision_headers = False
with_empty_folder = False
with_extra_commit_line = True
#+END_SRC

|------------+--------+------------------------------------------+-------------------------+--------------------------+------------|
| Type       | # Revs | Url                                      | git-svn (git svn clone) | swh-svn (+ with storage) |      Ratio |
|------------+--------+------------------------------------------+-------------------------+--------------------------+------------|
| small      |    145 | svn://svn.debian.org/svn/pkg-fox/        |                 447.074 |        547.6864733919501 |  1.2250466 |
| medium     |   6006 | svn://svn.debian.org/svn/glibc-bsd/      |                4740.928 |         4046.70439547766 | 0.85356799 |
| large      |  10707 | svn://svn.debian.org/svn/pkg-voip/       |                8592.398 |       28698.161668108776 |  3.3399479 |
| very large |  34523 | svn://svn.debian.org/svn/python-modules/ |               36627.907 |                          |         0. |
| very large |  48013 | svn://svn.debian.org/svn/pkg-gnome/      |               71902.080 |                          |         0. |
|------------+--------+------------------------------------------+-------------------------+--------------------------+------------|
#+TBLFM: $6=$5/$4
